package com.itheima.demo2;
/*
软件结构:
    c/s
    b/s

网络编程:
    概述:在一定的协议下,书写代码使得2台计算机在网络下进行通信
网络通信协议:通信协议是对计算机必须遵守的规则

TCP/IP协议： 传输控制协议/因特网互联协议( Transmission Control Protocol/Internet Protocol)，是Internet最基本、最广泛的协议
    TCP协议特点: 面向连接,数据安全,传输数据慢
                三次握手
        例如: 村长找到你,然后告诉你,你家的牛丢了

    UDP协议特点:面向无连接,数据不安全,传输数据快
        例如: 村长直接拿广播,播放张三,你家的牛丢了,不管张三能不能接收到
网络编程三要素:
协议:
    - 协议：计算机网络通信必须遵守的规则
Ip地址:
    - IP地址用来给一个网络中的计算机设备做唯一的编号
端口号:
    - 端口号就可以唯一标识设备中的进程（应用程序）

李晨  对  冰冰表白
1.找到冰冰          --->  IP地址
2.对耳朵的冰冰说     --->  端口号
3.我爱你            --->  协议


 */
public class Demo2 {
    public static void main(String[] args) {

    }
}
